In [1]:
import pandas as pd
import numpy as np

In [2]:
inp1= pd.read_csv("C://Users//HP//Desktop//My Uber Drives - 2016 (1).csv")

In [3]:
inp1.head()

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,01-01-2016 21:11,01-01-2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,01-02-2016 01:25,01-02-2016 01:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,01-02-2016 20:25,01-02-2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,01-05-2016 17:31,01-05-2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,01-06-2016 14:42,01-06-2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit

In [4]:
inp1.shape

(1156, 7)

In [5]:
inp1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1156 entries, 0 to 1155
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   START_DATE*  1156 non-null   object
 1   END_DATE*    1140 non-null   object
 2   CATEGORY*    1148 non-null   object
 3   START*       1152 non-null   object
 4   STOP*        1152 non-null   object
 5   MILES*       1148 non-null   float64
 6   PURPOSE*     648 non-null    object
dtypes: float64(1), object(6)
memory usage: 63.3+ KB

In [6]:
inp1.describe()

            MILES*
count   1148.00000
mean      21.21899
std      360.54760
min        0.50000
25%        2.87500
50%        6.00000
75%       10.42500
max    12204.70000

observation numbers of rows are 1156
and numbers of cloumns are 7

step2 data handling cleaning

checking miss value

In [7]:
inp1.isnull().sum()

START_DATE*      0
END_DATE*       16
CATEGORY*        8
START*           4
STOP*            4
MILES*           8
PURPOSE*       508
dtype: int64

In [8]:
(inp1.isnull().sum()/ len (inp1))*100

START_DATE*     0.000000
END_DATE*       1.384083
CATEGORY*       0.692042
START*          0.346021
STOP*           0.346021
MILES*          0.692042
PURPOSE*       43.944637
dtype: float64

In [9]:
inp1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1156 entries, 0 to 1155
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   START_DATE*  1156 non-null   object
 1   END_DATE*    1140 non-null   object
 2   CATEGORY*    1148 non-null   object
 3   START*       1152 non-null   object
 4   STOP*        1152 non-null   object
 5   MILES*       1148 non-null   float64
 6   PURPOSE*     648 non-null    object
dtypes: float64(1), object(6)
memory usage: 63.3+ KB

In [10]:
#x=inp1["START_DATE*"].mode()
x

NameError: name 'x' is not defined

In [ ]:
#inp1["START_DATE*"].fillna(x[0],inplace=True)

In [ ]:
#inp1["START_DATE*"].isnull().sum()

In [11]:
inp2 = inp1[~inp1['PURPOSE*'].isnull()]

In [15]:
inp2

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,01-01-2016 21:11,01-01-2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
2,01-02-2016 20:25,01-02-2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,01-05-2016 17:31,01-05-2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,01-06-2016 14:42,01-06-2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit
5,01-06-2016 17:15,01-06-2016 17:19,Business,West Palm Beach,West Palm Beach,4.3,Meal/Entertain
...,...,...,...,...,...,...,...
1150,12/31/2016 1:07,12/31/2016 1:14,Business,Kar?chi,Kar?chi,0.7,Meeting
1151,12/31/2016 13:24,12/31/2016 13:42,NaN,Kar?chi,Unknown Location,3.9,Temporary Site
1152,12/31/2016 15:03,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting
1153,12/31/2016 21:32,12/31/2016 21:50,Business,Katunayake,Gampaha,6.4,Temporary Site
1154,12/31/2016 22:08,12/31/2016 23:51,NaN,Gampaha,Ilukwatta,48.2,Temporary Site

In [18]:
inp2 = inp1[~inp1['END_DATE*'].isnull()]
inp2.shape

(1140, 7)

In [19]:
inp2['END_DATE*'].isnull().sum()

0